cchen7/pocket_oracle_esp32/firmware/sdkconfig.defaults.esp32s3
# ESP32-S3 (M5StickS3 = ESP32-S3-PICO-1-N8R8) specific defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash 8MB QIO @ 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM 8MB Octal @ 80MHz  ← CRITICAL: PICO-1-N8R8 is Octal, NOT Quad
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# USB-Serial-JTAG as console (B2 = console enabled by default)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_SUPPORT_ETS_PRINTF=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Console history & autocomplete
CONFIG_CONSOLE_UART_DEFAULT=n

# Power management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Light sleep allowed during idle (Wi-Fi/BLE coex still works)
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=y
CONFIG_PM_SLP_IRAM_OPT=y
CONFIG_PM_RTOS_IDLE_OPT=y
